In [4]:
import sqlite3 as sql

In [6]:
### connect to a database
connection = sql.connect('bda74.db')

In [7]:
#create a cursor object using the connection
cursor = connection.cursor()

In [14]:
## create a database table name people5 
cursor.execute(
               """ Create Table people5(
                   id Integer Primary Key, 
                   name Text Not Null,
                   age Integer,
                   city Text);""" 
               )

In [15]:
## inserting to the people 5 table
# Insert dummy data
dummy_data = [
    (1, "Alice", 30, "New York"),
    (2, "Bob", 25, "Los Angeles"),
    (3, "Charlie", 35, "Chicago"),
    (4, "Diana", 28, "Houston"),
    (5, "Ethan", 40, "Phoenix")
]

cursor.executemany("INSERT INTO people5 (id, name, age, city) VALUES (?, ?, ?, ?);", dummy_data)

## lets create a data frame for our people5 table

In [27]:
import pandas as pd

df = pd.read_sql_query("SELECT * FROM people5;", connection)

In [29]:
df.head()

   id     name  age         city
0   1    Alice   30     New York
1   2      Bob   25  Los Angeles
2   3  Charlie   35      Chicago
3   4    Diana   28      Houston
4   5    Ethan   40      Phoenix